{"data": {"title": "South Indian egg curry with rice & lentil pilau", "ingredients": ["4 tbsp vegetable oil", "1 ½ tsp mustard seeds", "1 ½ tbsp curry leaf", "2 large  red onions , chopped", "50g ginger , peeled and finely chopped", "1 tsp turmeric", "½ tsp chilli powder", "2 x 400g cans chopped tomatoes", "1-2 tsp sugar", "8 eggs", "small bunch coriander , chopped", "250g basmati rice", "140g split red lentil", "4 tbsp vegetable oil", "2 onions , sliced", "50g ginger , peeled and finely chopped", "3 whole green chillies , deseeded", "2 bay leaves", "mango chutney, natural yogurt and  naan bread (optional), to serve"], "method": [{"steps_heading": "STEP 1", "steps_editor_conten": "Mix the rice and lentils in a bowl. Cover with cold water and soak for 15 mins."}, {"steps_heading": "STEP 2", "steps_editor_conten": "Meanwhile, for the curry, heat the oil in a wok or medium saucepan, then toss in the mustard seeds followed by the curry leaves. Once the leaves have stopped spluttering, reduce the heat and add the onions and ginger. Fry over a medium heat for about 10 mins until golden."}, {"steps_heading": "STEP 3", "steps_editor_conten": "Stir in the turmeric and chilli powder and cook for a few more secs. Tip in the tomatoes and sugar. Simmer, uncovered, for 10-15 mins until thickened, adding a splash of water if needed. Meanwhile, boil the eggs for 8 mins, then cool under cold running water before peeling and halving. Add to the curry and cover with a tight-fitting lid."}, {"steps_heading": "STEP 4", "steps_editor_conten": "To cook the pilau, heat the oil in a pan and cook the onions, ginger and chillies until softened – about 10 mins. Drain the rice and lentils and add to the onions along with the bay leaves."}, {"steps_heading": "STEP 5", "steps_editor_conten": "Pour over enough water to cover the rice and lentils by a depth of 3cm – about 600ml. Simmer, uncovered, until tender and the cooking liquid has been absorbed."}, {"steps_heading": "STEP 6", "steps_editor_conten": "Stir the coriander into the curry and fluff up the rice. Serve with mango chutney, yogurt and naan, if you like."}]}}