{"data": {"title": "Spiced chicken & apricot pastilla", "ingredients": ["2 tbsp rapeseed oil or vegetable oil", "2 onions , halved and sliced", "2 garlic cloves , crushed", "2 tsp ground cinnamon", "2 tsp ground cumin", "2 tsp ground coriander", "1 tsp turmeric", "½ tsp fennel seeds", "4 chicken legs", "500ml chicken stock", "1 tbsp clear honey", "50g ground almonds", "1 lemon , zested and 1/2 juiced", "85g dried apricots , quartered", "small bunch parsley , chopped", "270g pack filo pastry (7 sheets)", "75g butter , melted", "icing sugar and cinnamon, for dusting (optional)"], "method": [{"steps_heading": "STEP 1", "steps_editor_conten": "Heat 1 tbsp oil in a large casserole dish and cook the onion and garlic for 8 mins until soft. Add the spices and stir for about 30 seconds until aromatic, then add the chicken. Pour in the chicken stock and season. Cover with a lid and leave to simmer for 45 mins, or until the chicken is tender."}, {"steps_heading": "STEP 2", "steps_editor_conten": "Lift the chicken pieces onto a plate. Add the honey and almonds to the cooking liquid and simmer until thick and reduced by half, then turn off the heat. Meanwhile, finely shred the chicken with two forks, discarding the skin and bones. Return the chicken to the sauce and stir in the lemon zest and juice, apricots and parsley, then leave to cool. Can be chilled for up to two days."}, {"steps_heading": "STEP 3", "steps_editor_conten": "Heat oven to 200C/180C fan/gas 6 with a baking sheet on the middle shelf. Unwrap the pastry, keeping any you’re not working with under a damp tea towel so it doesn’t dry out. Brush a 22-23cm springform or loose-bottomed round tin with a little oil. Push two pastry sheets into the tin to line the base, brushing them with melted butter and leaving a little extra up the sides. Repeat this with two more sheets across the other diameter of the tin so all sides are lined. Patch up any holes or thin patches with another sheet of buttered pastry."}, {"steps_heading": "STEP 4", "steps_editor_conten": "Spoon in the chicken mixture and pat down evenly. Sit another two sheets of pastry on top, brushing the melted butter between the layers again, and scrunching the edges of the pastry around the sides. Brush the top with a little more butter and bake on the heated baking sheet for 30 mins until crisp and golden brown. It’s best eaten warm, so leave to cool for about 30 mins. Dust with a pinch of icing sugar and cinnamon to serve, if you like."}]}}